Tekla.Structures.Datatype.SettingsProxy
The SettingsProxy class is a proxy for the settings.

Tekla.Structures.Datatype.SettingsProxy.#ctor
Creates a new settings proxy instance.

Tekla.Structures.Datatype.SettingsProxy.GetValue(System.String)
Gets the value of the setting with the given name.
name: The name of the setting.
Returns: The value of the given setting.

Tekla.Structures.Datatype.SettingsProxy.TryGetValue(System.String,System.Object@)
Tries to get the value of the setting with the given name.
name: The name of the setting.
obj: The value of the given setting.
Returns: True on success, false otherwise.

Tekla.Structures.Datatype.SettingsProxy.SetValue(System.String,System.Object)
Sets a setting to a value.
name: The name of the setting.
value: The new value for the setting.